Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpression Constructor (NumericFilterExpression, NumericOperatorType, NumericConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BinaryFilterExpression(
	NumericFilterExpression Left,
	NumericOperatorType Oper,
	NumericConstantFilterExpression Right
)
Public Sub New (
	Left As NumericFilterExpression,
	Oper As NumericOperatorType,
	Right As NumericConstantFilterExpression
)
Parameters
Left
Type: Tekla.Structures.Filtering.NumericFilterExpression
The left operand of the filter expression.
Oper
Type: Tekla.Structures.Filtering.NumericOperatorType
The operator of the filter expression.
Right
Type: Tekla.Structures.Filtering.NumericConstantFilterExpression
The right operand of the filter expression.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when a null filter expression is specified.
See Also
Reference
BinaryFilterExpression Class
BinaryFilterExpression Overload
Tekla.Structures.Filtering Namespace